character_api/app/controllers/characters_controller.rb

INSERT INTO "characters" ("name", "age", "eye_color", "created_at", "updated_at", "novel_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Name1"], ["age", "56"], ["eye_color", "green"], ["created_at", "2019-09-18 12:37:26.935833"], ["updated_at", "2019-09-18 12:37:26.935833"], ["novel_id", 1]]
---
  def create
    @character = Character.new(character_params)

    if @character.save