character_api/app/controllers/novels_controller.rb

SELECT "novels".* FROM "novels"
---
  def index
    @novels = Novel.all

INSERT INTO "novels" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Novel 3"], ["description", "Description text goes here"], ["created_at", "2019-09-17 18:36:38.703237"], ["updated_at", "2019-09-17 18:36:38.703237"]]
---
  def create
    @novel = Novel.new(novel_params)

    if @novel.save